 /$$                   /$$     /$$                                  
| $$                  | $$    | $$                                  
| $$$$$$$  /$$   /$$ /$$$$$$ /$$$$$$    /$$$$$$  /$$$$$$$   /$$$$$$$
| $$__  $$| $$  | $$|_  $$_/|_  $$_/   /$$__  $$| $$__  $$ /$$_____/
| $$  \ $$| $$  | $$  | $$    | $$    | $$  \ $$| $$  \ $$|  $$$$$$ 
| $$  | $$| $$  | $$  | $$ /$$| $$ /$$| $$  | $$| $$  | $$ \____  $$
| $$$$$$$/|  $$$$$$/  |  $$$$/|  $$$$/|  $$$$$$/| $$  | $$ /$$$$$$$/
|_______/  \______/    \___/   \___/   \______/ |__/  |__/|_______/



button-next = Дальше
button-understand = Понял
button-begin = Начать
button-ok = Конечно
button-back = Назад
button-confirm = Принять
button-great = Отлично!
button-good = Хорошо

button-stats = Характеристики
button-bag = Рюкзак
button-location = Локация


###################################################################################




 /$$$$$$/$$$$   /$$$$$$   /$$$$$$$ /$$$$$$$  /$$$$$$   /$$$$$$   /$$$$$$   /$$$$$$$
| $$_  $$_  $$ /$$__  $$ /$$_____//$$_____/ |____  $$ /$$__  $$ /$$__  $$ /$$_____/
| $$ \ $$ \ $$| $$$$$$$$|  $$$$$$|  $$$$$$   /$$$$$$$| $$  \ $$| $$$$$$$$|  $$$$$$ 
| $$ | $$ | $$| $$_____/ \____  $$\____  $$ /$$__  $$| $$  | $$| $$_____/ \____  $$
| $$ | $$ | $$|  $$$$$$$ /$$$$$$$//$$$$$$$/|  $$$$$$$|  $$$$$$$|  $$$$$$$ /$$$$$$$/
|__/ |__/ |__/ \_______/|_______/|_______/  \_______/ \____  $$ \_______/|_______/ 
                                                      /$$  \ $$                    
                                                     |  $$$$$$/                    
                                                      \______/              

###################################################################################


unknown-message = Я не понял, что ты сказал!

registration-speech0 = Здравствуй новобранец!
                      Я ARACHNA
                      Автономная Речевая Ассистентка 
                      С Хранилищем Нейронных Алгоритмов

                      У Вас есть возможность участвовать
                      в колонизации новой планеты в роли
                      пилота аватара.


registration-speech1 = Я думаю, Вы в курсе или догадываетесь,
                       что наша планета Земля умирает.
                       По этому с помощью математических рассчетов
                       была найдена новая планета с почти
                       пригодными для жизни условиями.

registration-speech2 = NOVA - New Orbital Viable Atmosphere
                       (Нова яорбитальная планета с
                       пригодной атмосферой)
                       Наш новый дом.

                       По результатам зондирования на планете
                       повышенная радиация, есть своя флора,
                       фауна и, возможно, даже признаки
                       Магии.

registration-speech3 = Вы готовы к первому подключению 
                       Вашего аватара?

registration-speech4 = Регистрация прошла успешно!
                       Прошу, аккуратно относитесь к аватару.

                       Каждый Аватар - это человекоподобный дроид
                       который стоит более 2 300 000 000 €.

registration-speech5 = У Вашего аватара на данный момент
                        будет стандартный набор колонизатора.
                        Экипировка Космонавта, пистолет, тушенка,
                        аптечки и бинты.

                        К сожалению, Экипировка поношена, в связи с 
                        перелетом... Но я уверена, Вы быстро найдете
                        ей замену.

current-location = Локация { $location }

location-intransit = В пути
                     Вы прибудите к месту назначения 
                     { $destination }